---
layout: post
title: "面经"
categories: [other]
---

## 2013-09-13 微软海外

这是第一次面试吧

## 2013-09-23 阿里

由于之前暑假拿到了阿里小微金融数据挖掘部门的实习offer，所以正式校招的时候直接进到了终面(跳过了笔试和一面),终面都是在问学习履历，项目经验以及人生理想，中间只问了两三个计算机相关的知识，也是相当常见的面试题目，所以感觉终面很水，以至于我一度怀疑自己被刷了，等到发offer那天，其他人都陆陆续续收到了通知，过了5点半还没收到，本来都绝望了，突然在吃饭的时候收到了，真心悬啊

其实，我对这个offer很有信心的，一是本来就拿到了实习offer，在加上我做了挺多相关项目而且看了不少机器学习的书，感觉挺有底气的，谁知，直接进了终面，机器学习的东西完全没问，自己的能力完全没表现出来，感觉还不如没有这个实习offer，直接从一面技术面开始呢

在拿到offer前，心里一直在打鼓，虽然真的想不出终面面试官直接挂我的理由，但是自己有没表现出实力，真的很纠结，这也使我懂得，赛翁失马，焉知非福的道理，很羡慕那些从笔试，一面，二面走过来的

身边的同学好多拿到了A级的offer，而我只有一个B+的，心里还是有点不爽，不过部门是自己最开始实习就选定了，还是比较满意的

这次拿到阿里拿的offer太easy了，这也是只有B+的部分原因吧

##2013-09-26 WAP

Works Application 日企，做ERP的企业，特点是全球统一薪资，所以在国内比其他公司的工资高出一大截，不过去年日元汇率大跌，现在大概0.6左右，所以WAP的工资也缩水不少，600w日元，折合人民币36w左右吧

WAP招聘流程比较特殊，显示在两三个月前做了一份笔试题目，如果笔试题目做的不错，就会有面试机会，前面的笔试题目网上一大堆，就不细说了，简单说一下面经吧，面试过程很简单，开始过去先做一个小时的‘笔试题目’，这个笔试题目非常简单，都是一些基本的数学和逻辑推理题目，直接PASS，后面有一至三轮面试，如果表现不好，第一轮就挂了，这样的人比较少的，还有就是表现比较好，要么第一轮就给你实习offer(11月份去实习9天，之后根据实习表现判断是否转正)，表现再好一点，就会给二面，二面表现不好，就直接给实习offer(ps
我就走到这里的），如果表现好的话，就会进三面，现场拿offer，现场拿offer的比例其实还是挺高的，北京100人有面试机会，发了50左右的实习offer和十几个现场offer

面试时，会给你一台笔记本，Eclipse已经打开，里面有很多工程，找到自己的，新建一个类开始Coding

第一轮面试是一个年轻的工程师，日本人，英语说的比我还拗口，不过面试过程也不需要交流太多，差不多能理解对方就OK了，一面面了两道题目，都是几个月前笔试题目的变种（变简单了），具体题目就不说了，因为开始面试前都签署了保密协议的，还有就是题目本身真的不重要，关键还是了解面试的考点和形式吧～二面形式和一面相同，题目可能更难一点，需要一些算法了

面试需要注意的一点是提问，当每轮面试结束时，面试官都会问你有没有问题，这个还是比较关键的，面试前最好准备一下

